app/Http/Controllers/Auth/AuthController.php

insert into `users` (`email`, `password`, `first_name`, `first_name_furigana`, `last_name`, `last_name_furigana`, `phone_number`, `address`, `remember_token`, `birthday`, `gender`, `updated_at`, `created_at`) values ('toyosima11031103@hotmail.co.jp', '$2y$10$1RTo5eVnRqYJxkJ9KoYk1eyGSSF9id3XX3fFkdTzxnBDUgoBMOHem', '昭平', 'しょうへい', '豊島', 'とよしま', '09012345678', '福岡県福岡市博多区', '', '2000-02-22', 'male', '2023-09-12 09:58:36', '2023-09-12 09:58:36')
---
    public function registerAdd(Request $request)
    {

        // ユーザーの登録処理
        $user = new User;
        $user->email = $request->input('email');
        $user->password = Hash::make($request->input('password'));
        $user->first_name = $request->input('first_name');
        $user->first_name_furigana = $request->input('first_name_furigana');
        $user->last_name = $request->input('last_name');
        $user->last_name_furigana = $request->input('last_name_furigana');
        $user->phone_number = $request->input('phone_number');
        $user->address = $request->input('address');
        $user->remember_token = $request->input('remember_token');
        $user->birthday = $request->input('birthday');
        $user->gender = $request->input('gender');

        // ユーザーを保存
        $user->save();