app/Http/Controllers/BookmarkController.php

    public function store(Request $request) {

      try {
        $bookmark = new Bookmark();
        $bookmark->user_id = Auth::user()->id;
        $bookmark->company_id = $request->input('company_id');

        // すでに登録されている場合は、何もしない
        if (Bookmark::where('user_id', $bookmark->user_id)
            ->where('company_id', $bookmark->company_id)
            ->exists()) {
            return back();
        }

        $bookmark->save();
---
select exists(select * from `bookmarks` where `user_id` = 4 and `company_id` = '1') as `exists`
insert into `bookmarks` (`user_id`, `company_id`, `updated_at`, `created_at`) values (4, '1', '2023-09-22 11:50:34', '2023-09-22 11:50:34')