app/Http/Controllers/CalendarController.php

    public function getEvents()
    {
        $query = Leave_Application::query(); // すべてのレコードを取得

        $leaveApplications = $query->get();
---
select * from `leave_applications`