app/Http/Controllers/HomeController.php

select * from `notifications` order by `created_at` desc
select count(*) as aggregate from `bookmarks` where `user_id` = 1
---
    public function index()
    {
        #通知一覧表示
        $notifications = Notification::orderBy('created_at', 'desc')->get();

        $bookmark_count = Bookmark::where('user_id', Auth::user()->id)->count();